In [169]:
import pandas
base = pandas.read_csv("data.csv", sep="\t", header=None)

In [170]:
base

    0  1           2        3                                    4
0   E  1  1999-02-28    b,g,f        jjj:3,bbb:0,ddd:9,ggg:8,hhh:2
1   A  2  1999-10-28    a,f,c              ccc:2,ddd:0,aaa:3,hhh:9
2   B  5  1998-05-02  f,e,a,c              ddd:2,ggg:5,ccc:6,jjj:1
3   A  3  1999-08-28      a,b              hhh:9,iii:5,eee:7,bbb:1
4   C  6  1999-12-01  f,g,d,a              iii:6,ddd:5,eee:4,jjj:3
5   A  7  1998-07-28      c,d        bbb:2,hhh:0,ccc:4,fff:1,aaa:7
6   A  9  1997-02-28    g,d,a  aaa:5,fff:8,ddd:2,iii:0,jjj:7,ccc:1
7   B  1  1999-05-10      b,a                    fff:3,hhh:1,ddd:2
8   E  2  1997-04-12  d,e,a,f  eee:4,ccc:5,iii:9,fff:7,ggg:6,bbb:0
9   B  3  1999-11-23  d,b,g,f  bbb:7,jjj:9,fff:5,iii:4,ggg:2,eee:3
10  C  7  1998-01-17  d,c,f,b        hhh:6,eee:4,iii:0,fff:2,jjj:1
11  C  5  1998-12-28  d,e,a,c                    bbb:7,iii:6,ggg:9
12  D  3  1999-10-15  g,e,f,b        bbb:9,aaa:3,ccc:6,fff:4,eee:2
13  E  8  1998-11-01      c,f                    aaa:8,ddd:5,jjj:1
14  B  9  1999-08-12      d,b        ccc:0,jjj:6,fff:7,ddd:3,aaa:2
15  D  1  1997-12-01      f,e              ccc:0,eee:6,bbb:9,ddd:3
16  E  3  1997-07-28    e,b,f  bbb:6,iii:3,hhh:5,fff:4,ggg:9,ddd:2
17  D  5  1998-08-12      g,a                    hhh:4,jjj:5,ccc:9
18  E  8  1999-08-24  e,c,f,a                    ccc:1,iii:6,fff:9
19  E  9  1998-01-23      e,a                    bbb:9,aaa:3,fff:1
20  E  7  1999-06-22      e,f                    ddd:9,iii:2,aaa:4
21  E  3  1999-04-24    c,b,g                    ccc:5,fff:8,iii:7
22  D  5  1999-06-25    c,f,a                    eee:3,jjj:2,ddd:7
23  A  1  1999-08-25    f,a,d        jjj:1,ggg:0,ccc:7,ddd:9,bbb:3
24  E  4  1997-07-26      c,d  jjj:6,ccc:0,aaa:1,hhh:9,iii:7,ggg:8
25  E  6  1997-09-24    e,d,c  fff:3,eee:6,iii:4,bbb:7,ddd:0,ccc:1
26  A  8  1997-09-28    a,e,f                    fff:0,ddd:5,ccc:4
27  E  5  1999-06-22    c,a,g        ggg:6,hhh:3,ddd:9,ccc:0,jjj:7
28  A  6  1999-07-29      f,e        hhh:6,jjj:0,eee:5,iii:7,ccc:3
29  C  0  1999-08-22  f,c,a,g  eee:1,fff:4,aaa:2,ccc:7,ggg:0,ddd:6
30  A  1  1998-04-26      b,f        ccc:6,aaa:9,eee:5,ddd:0,bbb:3
31  D  2  1998-02-24      b,f  bbb:7,hhh:1,aaa:6,iii:4,fff:9,ddd:5
32  E  5  1999-03-24      a,c              fff:3,ccc:1,ggg:2,eee:5
33  B  4  1998-03-23    b,f,c  iii:7,ggg:3,ddd:0,jjj:8,hhh:5,ccc:1
34  B  6  1999-04-21    f,a,e        hhh:6,ccc:3,jjj:0,bbb:8,ddd:7
35  D  7  1999-02-29      a,f                    aaa:0,fff:5,ddd:3
36  B  8  1997-05-21      c,a        ddd:5,jjj:2,iii:7,ccc:0,bbb:4
37  C  9  1997-07-22  c,a,e,f                    eee:0,fff:2,hhh:6
38  E  1  1999-09-28      e,d                    fff:9,iii:2,eee:0
39  E  5  1998-01-26    f,a,d                    hhh:8,ggg:3,jjj:5

# Q01

In [171]:
## Imprima la suma de la segunda columna.

In [172]:
import pandas
base = pandas.read_csv("data.csv", sep="\t", header=None)
q01 = base[1].sum()
print(q01)

190

# Q02

In [173]:
## Imprima la cantidad de registros por letra para la 
## primera columna, ordenados alfabeticamente.

In [174]:
import pandas
base = pandas.read_csv("data.csv", sep="\t", header=None)
base.head()

   0  1           2        3                              4
0  E  1  1999-02-28    b,g,f  jjj:3,bbb:0,ddd:9,ggg:8,hhh:2
1  A  2  1999-10-28    a,f,c        ccc:2,ddd:0,aaa:3,hhh:9
2  B  5  1998-05-02  f,e,a,c        ddd:2,ggg:5,ccc:6,jjj:1
3  A  3  1999-08-28      a,b        hhh:9,iii:5,eee:7,bbb:1
4  C  6  1999-12-01  f,g,d,a        iii:6,ddd:5,eee:4,jjj:3

In [175]:
q02list = list(base[0])

In [176]:
q02list

['E',
 'A',
 'B',
 'A',
 'C',
 'A',
 'A',
 'B',
 'E',
 'B',
 'C',
 'C',
 'D',
 'E',
 'B',
 'D',
 'E',
 'D',
 'E',
 'E',
 'E',
 'E',
 'D',
 'A',
 'E',
 'E',
 'A',
 'E',
 'A',
 'C',
 'A',
 'D',
 'E',
 'B',
 'B',
 'D',
 'B',
 'C',
 'E',
 'E']

In [177]:
uniqueletters = set(q02list)

In [178]:
uniqueletters

{'A', 'B', 'C', 'D', 'E'}

In [179]:
q02c = [(l, q02list.count(l)) for l in sorted(uniqueletters)]
q02c

[('A', 8), ('B', 7), ('C', 5), ('D', 6), ('E', 14)]

In [180]:
q02c[0][0]

'A'

In [181]:
for i in range(5):
    print(q02c[i][0],q02c[i][1], sep=',')

A,8
B,7
C,5
D,6
E,14

# Q03

In [182]:
## Imprima la suma de la columna 2 por cada letra de la 
## primera columna, ordneados alfabeticamente.

In [183]:
import pandas
base = pandas.read_csv("data.csv", sep="\t", header=None)
base.head(1)

   0  1           2      3                              4
0  E  1  1999-02-28  b,g,f  jjj:3,bbb:0,ddd:9,ggg:8,hhh:2

In [184]:
q03c = base.groupby(0).sum()[1]

In [185]:
print(q03c)

0
A    37
B    36
C    27
D    23
E    67
Name: 1, dtype: int64

In [186]:
q03l = list(q03c)

In [187]:
ul = list(uniqueletters)

In [188]:
letters = sorted(uniqueletters)

In [189]:
q03l

[37, 36, 27, 23, 67]

In [190]:
letters

['A', 'B', 'C', 'D', 'E']

In [191]:
for i in range(5):
    print(letters[i], q03l[i], sep=',')

A,37
B,36
C,27
D,23
E,67

# Q04

In [6]:
## Imprima la cantidad de registros por cada mes.
import pandas
base = pandas.read_csv("data.csv", sep="\t", header=None)
base.head(1)

   0  1           2      3                              4
0  E  1  1999-02-28  b,g,f  jjj:3,bbb:0,ddd:9,ggg:8,hhh:2

In [7]:
import datetime

In [8]:
base[2] = pandas.to_datetime(base[2], errors='ignore')

In [9]:
base[2].dt

In [10]:
base['mes'] = base[2].dt.month

In [11]:
base.head()

   0  1          2        3                              4  mes
0  E  1 1999-02-28    b,g,f  jjj:3,bbb:0,ddd:9,ggg:8,hhh:2    2
1  A  2 1999-10-28    a,f,c        ccc:2,ddd:0,aaa:3,hhh:9   10
2  B  5 1998-05-02  f,e,a,c        ddd:2,ggg:5,ccc:6,jjj:1    5
3  A  3 1999-08-28      a,b        hhh:9,iii:5,eee:7,bbb:1    8
4  C  6 1999-12-01  f,g,d,a        iii:6,ddd:5,eee:4,jjj:3   12

In [12]:
base1 = base.groupby('mes')[1].count()

In [13]:
print(base1)

mes
1     3
2     4
3     2
4     4
5     3
6     3
7     5
8     6
9     3
10    2
11    2
12    3
Name: 1, dtype: int64

In [14]:
%run q04.py

mes
1     3
2     4
3     2
4     4
5     3
6     3
7     5
8     6
9     3
10    2
11    2
12    3
Name: 1, dtype: int64

# Q05

In [194]:
#Imprima el valor maximo y minimo por cada letra de la columa 1.
import pandas
base = pandas.read_csv("data.csv", sep="\t", header=None)

In [195]:
q051 = base.groupby(0).max()[1]
q051

0
A    9
B    9
C    9
D    7
E    9
Name: 1, dtype: int64

In [196]:
q052 = base.groupby(0).min()[1]
q052

0
A    1
B    1
C    0
D    1
E    1
Name: 1, dtype: int64

In [197]:
q051l = list(q051)
q052l = list(q052)

In [198]:
q02list = list(base[0])
uniqueletters = set(q02list)
ul = list(uniqueletters)
letters = sorted(uniqueletters)

In [199]:
for i in range(5):
    print(letters[i], q051l[i], q052l[i], sep=',')

A,9,1
B,9,1
C,9,0
D,7,1
E,9,1

# Q06

In [62]:
## Por cada clave de la columna 5 (cadena de tres letras), obtenga
## el valor mas pequeño y el valor mas grande asociado a esa clave.
import pandas
base = pandas.read_csv("data.csv", sep="\t", header=None)

In [63]:
base.head(1)

   0  1           2      3                              4
0  E  1  1999-02-28  b,g,f  jjj:3,bbb:0,ddd:9,ggg:8,hhh:2

In [64]:
base1 = base[4].apply(lambda x: pandas.Series(x.split(','))) #Separo los elementos de la columna

In [87]:
base1.head()

       0      1      2      3      4    5
0  jjj:3  bbb:0  ddd:9  ggg:8  hhh:2  NaN
1  ccc:2  ddd:0  aaa:3  hhh:9    NaN  NaN
2  ddd:2  ggg:5  ccc:6  jjj:1    NaN  NaN
3  hhh:9  iii:5  eee:7  bbb:1    NaN  NaN
4  iii:6  ddd:5  eee:4  jjj:3    NaN  NaN

In [66]:
#Sacar cada columna por separado eliminando los NaN
base10 = base1[0].dropna()
base11 = base1[1].dropna()
base12 = base1[2].dropna()
base13 = base1[3].dropna()
base14 = base1[4].dropna()
base15 = base1[5].dropna()

In [67]:
base100 = list(base10)
base111 = list(base11)
base122 = list(base12)
base133 = list(base13)
base144 = list(base14)
base155 = list(base15)

In [69]:
#Concatenar las lista
baselistas = base100+base111+base122+base133+base144+base155

In [71]:
#Convertir lista completa a dataframe
basedataframe = pandas.DataFrame({'col':baselistas})

In [82]:
basedataframe.head()

     col
0  jjj:3
1  ccc:2
2  ddd:2
3  hhh:9
4  iii:6

In [74]:
#Separar trio de letras y numero
basedataframe1 = basedataframe['col'].apply(lambda x: pandas.Series(x.split(':')))

In [75]:
basedataframe1.head(2)

     0  1
0  jjj  3
1  ccc  2

In [85]:
basefinalmax = basedataframe1.groupby(0)[1].max()

0
aaa    9
bbb    9
ccc    9
ddd    9
eee    7
fff    9
ggg    9
hhh    9
iii    9
jjj    9
Name: 1, dtype: object

In [86]:
basefinalmin = basedataframe1.groupby(0)[1].min()

0
aaa    0
bbb    0
ccc    0
ddd    0
eee    0
fff    0
ggg    0
hhh    0
iii    0
jjj    0
Name: 1, dtype: object

In [88]:
triolist = list(basedataframe1[0])

In [90]:
triounique = set(triolist)
triounique

{'aaa', 'bbb', 'ccc', 'ddd', 'eee', 'fff', 'ggg', 'hhh', 'iii', 'jjj'}

In [94]:
trio = sorted(triounique)
trio

['aaa', 'bbb', 'ccc', 'ddd', 'eee', 'fff', 'ggg', 'hhh', 'iii', 'jjj']

In [95]:
basefinalmaxl = list(basefinalmax)
basefinalminl = list(basefinalmin)

In [96]:
for i in range(len(trio)):
    print(trio[i], basefinalminl[i], basefinalmaxl[i], sep=',')

aaa,0,9
bbb,0,9
ccc,0,9
ddd,0,9
eee,0,7
fff,0,9
ggg,0,9
hhh,0,9
iii,0,9
jjj,0,9

In [97]:
%run q06.py

aaa,0,9
bbb,0,9
ccc,0,9
ddd,0,9
eee,0,7
fff,0,9
ggg,0,9
hhh,0,9
iii,0,9
jjj,0,9

# Q10

In [ ]:
## Imprima una tabla en formato CSV que contenga por cada clave 
## de la columna 5, la correspondiente cantidad de registros 
## asociados (filas en el archivo)

In [98]:
import pandas
base = pandas.read_csv("data.csv", sep="\t", header=None)

In [99]:
base.head()

   0  1           2        3                              4
0  E  1  1999-02-28    b,g,f  jjj:3,bbb:0,ddd:9,ggg:8,hhh:2
1  A  2  1999-10-28    a,f,c        ccc:2,ddd:0,aaa:3,hhh:9
2  B  5  1998-05-02  f,e,a,c        ddd:2,ggg:5,ccc:6,jjj:1
3  A  3  1999-08-28      a,b        hhh:9,iii:5,eee:7,bbb:1
4  C  6  1999-12-01  f,g,d,a        iii:6,ddd:5,eee:4,jjj:3

In [100]:
#Separo los elementos de la columna
base1 = base[4].apply(lambda x: pandas.Series(x.split(',')))

In [101]:
#Sacar cada columna por separado eliminando los NaN
base10 = base1[0].dropna()
base11 = base1[1].dropna()
base12 = base1[2].dropna()
base13 = base1[3].dropna()
base14 = base1[4].dropna()
base15 = base1[5].dropna()

base100 = list(base10)
base111 = list(base11)
base122 = list(base12)
base133 = list(base13)
base144 = list(base14)
base155 = list(base15)

#Concatenar las lista
baselistas = base100+base111+base122+base133+base144+base155

#Convertir lista completa a dataframe
basedataframe = pandas.DataFrame({'col':baselistas})

#Separar trio de letras y numero
basedataframe1 = basedataframe['col'].apply(lambda x: pandas.Series(x.split(':')))

In [103]:
basedataframe1.head()

     0  1
0  jjj  3
1  ccc  2
2  ddd  2
3  hhh  9
4  iii  6

In [105]:
basedataframe2 = basedataframe1.groupby(0)[1].count()

In [107]:
triolist = list(basedataframe1[0])
triounique = set(triolist)
trio = sorted(triounique)
basedataframe2l = list(basedataframe2)

for i in range(len(trio)):
    print(trio[i], basedataframe2l[i], sep=',')

aaa,13
bbb,16
ccc,23
ddd,23
eee,15
fff,20
ggg,13
hhh,16
iii,18
jjj,18

In [108]:
%run q10.py

aaa,13
bbb,16
ccc,23
ddd,23
eee,15
fff,20
ggg,13
hhh,16
iii,18
jjj,18

# Q11

In [109]:
## Imprima una tabla en formato CSV que contenga por registro,
## la cantidad de elementos de las columnas 4 y 5
## (filas en el archivo)
##
## E,3,5
## A,3,4
## B,4,4
## ...
## C,4,3
## E,2,3
## E,3,3

In [123]:
import pandas
base = pandas.read_csv("data.csv", sep="\t", header=None)

In [124]:
base.head()

   0  1           2        3                              4
0  E  1  1999-02-28    b,g,f  jjj:3,bbb:0,ddd:9,ggg:8,hhh:2
1  A  2  1999-10-28    a,f,c        ccc:2,ddd:0,aaa:3,hhh:9
2  B  5  1998-05-02  f,e,a,c        ddd:2,ggg:5,ccc:6,jjj:1
3  A  3  1999-08-28      a,b        hhh:9,iii:5,eee:7,bbb:1
4  C  6  1999-12-01  f,g,d,a        iii:6,ddd:5,eee:4,jjj:3

In [137]:
#Contar los registros de los campos 3 y 4 separados por ,
base['count3'] = base[3].str.split(",").str.len()
base['count4'] = base[4].str.split(",").str.len()

In [129]:
base.head()

   0  1           2        3                              4  count3  count4
0  E  1  1999-02-28    b,g,f  jjj:3,bbb:0,ddd:9,ggg:8,hhh:2       3       5
1  A  2  1999-10-28    a,f,c        ccc:2,ddd:0,aaa:3,hhh:9       3       4
2  B  5  1998-05-02  f,e,a,c        ddd:2,ggg:5,ccc:6,jjj:1       4       4
3  A  3  1999-08-28      a,b        hhh:9,iii:5,eee:7,bbb:1       2       4
4  C  6  1999-12-01  f,g,d,a        iii:6,ddd:5,eee:4,jjj:3       4       4

In [133]:
basefinal = base[[0,'count3','count4']]

In [136]:
print(basefinal)

    0  count3  count4
0   E       3       5
1   A       3       4
2   B       4       4
3   A       2       4
4   C       4       4
5   A       2       5
6   A       3       6
7   B       2       3
8   E       4       6
9   B       4       6
10  C       4       5
11  C       4       3
12  D       4       5
13  E       2       3
14  B       2       5
15  D       2       4
16  E       3       6
17  D       2       3
18  E       4       3
19  E       2       3
20  E       2       3
21  E       3       3
22  D       3       3
23  A       3       5
24  E       2       6
25  E       3       6
26  A       3       3
27  E       3       5
28  A       2       5
29  C       4       6
30  A       2       5
31  D       2       6
32  E       2       4
33  B       3       6
34  B       3       5
35  D       2       3
36  B       2       5
37  C       4       3
38  E       2       3
39  E       3       3

In [138]:
%run q11.py

    0  count3  count4
0   E       3       5
1   A       3       4
2   B       4       4
3   A       2       4
4   C       4       4
5   A       2       5
6   A       3       6
7   B       2       3
8   E       4       6
9   B       4       6
10  C       4       5
11  C       4       3
12  D       4       5
13  E       2       3
14  B       2       5
15  D       2       4
16  E       3       6
17  D       2       3
18  E       4       3
19  E       2       3
20  E       2       3
21  E       3       3
22  D       3       3
23  A       3       5
24  E       2       6
25  E       3       6
26  A       3       3
27  E       3       5
28  A       2       5
29  C       4       6
30  A       2       5
31  D       2       6
32  E       2       4
33  B       3       6
34  B       3       5
35  D       2       3
36  B       2       5
37  C       4       3
38  E       2       3
39  E       3       3

# Q12

In [139]:
## Imprima la suma de la columna 2 por cada letra 
## de la columna 4, ordnados alfabeticamente.
##
## a,114
## b,40
## c,91
## d,65
## e,79
## f,110
## g,35

In [140]:
import pandas
base = pandas.read_csv("data.csv", sep="\t", header=None)
base.head()

   0  1           2        3                              4
0  E  1  1999-02-28    b,g,f  jjj:3,bbb:0,ddd:9,ggg:8,hhh:2
1  A  2  1999-10-28    a,f,c        ccc:2,ddd:0,aaa:3,hhh:9
2  B  5  1998-05-02  f,e,a,c        ddd:2,ggg:5,ccc:6,jjj:1
3  A  3  1999-08-28      a,b        hhh:9,iii:5,eee:7,bbb:1
4  C  6  1999-12-01  f,g,d,a        iii:6,ddd:5,eee:4,jjj:3